Repository: cobaemon/ServerlessPortfolio
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, es, fr, ja, ru, zh_hans

source: With 4 years of programming experience, I have acquired a wide range of languages and technologies. I have studied C++, C, and C#, and have also self-taught Python and Dart/Flutter. Utilizing these skills, I have tackled various projects.
ar: مع خبرة برمجة لمدة 4 سنوات، اكتسبت مجموعة واسعة من اللغات والتقنيات. درست C++ وC وC#، كما علمت نفسي Python وDart/Flutter. باستخدام هذه المهارات، تناولت مشاريع مختلفة.
es: Con 4 años de experiencia en programación, he adquirido una amplia gama de lenguajes y tecnologías. He estudiado C++, C y C#, y también he aprendido Python y Dart/Flutter de forma autodidacta. Utilizando estas habilidades, he abordado varios proyectos.
fr: Avec 4 ans d'expérience en programmation, j'ai acquis une large gamme de langages et de technologies. J'ai étudié le C++, le C et le C#, et j'ai aussi appris Python et Dart/Flutter en autodidacte. En utilisant ces compétences, j'ai abordé divers projets.
ja: 4年間のプログラミング経験を通じて、幅広い言語と技術を習得しました。C++、C、C#を学び、PythonとDart/Flutterも独学で習得しました。これらのスキルを活用して、さまざまなプロジェクトに取り組んできました。
ru: Имея 4 года опыта в программировании, я освоил широкий спектр языков и технологий. Я изучал C++, C и C#, а также самостоятельно изучил Python и Dart/Flutter. Используя эти навыки, я выполнил различные проекты.
zh_hans: 拥有4年的编程经验，我掌握了多种语言和技术。我学习了C++、C和C#，还自学了Python和Dart/Flutter。利用这些技能，我完成了各种项目。

source: In Python-based projects, I developed a household budget app, a password management app, and a web portfolio using the Django framework. Additionally, I created a handwritten character recognition app by leveraging machine learning technology.
ar: في المشاريع المبنية على Python، طورت تطبيق ميزانية الأسرة، وتطبيق إدارة كلمات المرور، ومحفظة ويب باستخدام إطار Django. بالإضافة إلى ذلك، أنشأت تطبيقًا للتعرف على الحروف المكتوبة بخط اليد باستخدام تكنولوجيا التعلم الآلي.
es: En proyectos basados en Python, desarrollé una aplicación de presupuesto familiar, una aplicación de gestión de contraseñas y un portafolio web utilizando el framework Django. Además, creé una aplicación de reconocimiento de caracteres manuscritos aprovechando la tecnología de aprendizaje automático.
fr: Dans les projets basés sur Python, j'ai développé une application de budget familial, une application de gestion de mots de passe et un portfolio web en utilisant le framework Django. De plus, j'ai créé une application de reconnaissance de caractères manuscrits en utilisant la technologie de l'apprentissage automatique.
ja: Pythonベースのプロジェクトでは、家庭の予算アプリ、パスワード管理アプリ、Djangoフレームワークを使用したWebポートフォリオを開発しました。さらに、機械学習技術を活用して手書き文字認識アプリを作成しました。
ru: В проектах на основе Python я разработал приложение для ведения домашнего бюджета, приложение для управления паролями и веб-портфолио с использованием фреймворка Django. Кроме того, я создал приложение для распознавания рукописных символов, используя технологии машинного обучения.
zh_hans: 在基于Python的项目中，我开发了一个家庭预算应用程序、一个密码管理应用程序和一个使用Django框架的网络投资组合。此外，我还利用机器学习技术创建了一个手写字符识别应用程序。

source: In Dart/Flutter development, I created a database access control app. Through this experience, I have been able to improve my development capabilities across different platforms and environments.
ar: في تطوير Dart/Flutter، أنشأت تطبيقًا للتحكم في الوصول إلى قاعدة البيانات. من خلال هذه التجربة، تمكنت من تحسين قدراتي في التطوير عبر منصات وبيئات مختلفة.
es: En el desarrollo de Dart/Flutter, creé una aplicación de control de acceso a bases de datos. A través de esta experiencia, he podido mejorar mis capacidades de desarrollo en diferentes plataformas y entornos.
fr: Dans le développement Dart/Flutter, j'ai créé une application de contrôle d'accès aux bases de données. Grâce à cette expérience, j'ai pu améliorer mes capacités de développement sur différentes plateformes et environnements.
ja: Dart/Flutterの開発では、データベースアクセス制御アプリを作成しました。この経験を通じて、さまざまなプラットフォームや環境での開発能力を向上させることができました。
ru: В разработке на Dart/Flutter я создал приложение для управления доступом к базе данных. Благодаря этому опыту, я смог улучшить свои навыки разработки на разных платформах и в разных средах.
zh_hans: 在Dart/Flutter开发中，我创建了一个数据库访问控制应用程序。通过这段经历，我能够提升在不同平台和环境中的开发能力。

source: I have actively participated in team projects, developing file-sharing apps and household budget apps. This has allowed me to hone my team development skills and acquire the ability to collaborate with other members to advance projects. My diverse technical expertise and teamwork will surely be put to good use in future projects.
ar: لقد شاركت بنشاط في مشاريع الفريق، حيث طورت تطبيقات مشاركة الملفات وتطبيقات ميزانية الأسرة. لقد سمح لي هذا بصقل مهاراتي في تطوير الفريق واكتساب القدرة على التعاون مع أعضاء آخرين لدفع المشاريع قدمًا. ستكون خبرتي التقنية المتنوعة والعمل الجماعي مفيدة بالتأكيد في المشاريع المستقبلية.
es: He participado activamente en proyectos de equipo, desarrollando aplicaciones de compartición de archivos y aplicaciones de presupuesto familiar. Esto me ha permitido perfeccionar mis habilidades de desarrollo en equipo y adquirir la capacidad de colaborar con otros miembros para avanzar en los proyectos. Mi diversa experiencia técnica y trabajo en equipo seguramente se aprovecharán en futuros proyectos.
fr: J'ai participé activement à des projets d'équipe, développant des applications de partage de fichiers et des applications de budget familial. Cela m'a permis d'affiner mes compétences en développement d'équipe et d'acquérir la capacité de collaborer avec d'autres membres pour faire avancer les projets. Mon expertise technique diversifiée et mon esprit d'équipe seront sûrement mis à profit dans les projets futurs.
ja: 私は積極的にチームプロジェクトに参加し、ファイル共有アプリや家庭の予算アプリを開発してきました。これにより、チーム開発のスキルを磨き、他のメンバーと協力してプロジェクトを進める能力を身につけることができました。私の多様な技術的専門知識とチームワークは、将来のプロジェクトで確実に役立つでしょう。
ru: Я активно участвовал в командных проектах, разрабатывая приложения для обмена файлами и приложения для ведения домашнего бюджета. Это позволило мне отточить свои навыки работы в команде и приобрести способность сотрудничать с другими участниками для продвижения проектов. Мои разнообразные технические знания и командная работа наверняка будут полезны в будущих проектах.
zh_hans: 我积极参与团队项目，开发了文件共享应用程序和家庭预算应用程序。这使我能够磨练团队开发技能，并获得与其他成员合作推进项目的能力。我的多样化技术专长和团队合作能力在未来的项目中一定会得到很好的应用。

source: Your message has been sent successfully.
ar: تم إرسال رسالتك بنجاح.
es: Tu mensaje ha sido enviado con éxito.
fr: Votre message a été envoyé avec succès.
ja: メッセージは正常に送信されました。
ru: Ваше сообщение успешно отправлено.
zh_hans: 您的消息已成功发送。

source: Your message could not be sent. Please try again.
ar: تعذر إرسال رسالتك. يرجى المحاولة مرة أخرى.
es: No se pudo enviar tu mensaje. Por favor, inténtalo de nuevo.
fr: Votre message n'a pas pu être envoyé. Veuillez réessayer.
ja: メッセージを送信できませんでした。もう一度お試しください。
ru: Не удалось отправить ваше сообщение. Пожалуйста, попробуйте еще раз.
zh_hans: 无法发送您的消息。请再试一次。

source: Password Box is a service that allows you to store passwords, account names, and email addresses.
ar: Password Box هي خدمة تتيح لك تخزين كلمات المرور وأسماء الحسابات وعناوين البريد الإلكتروني.
es: Password Box es un servicio que te permite almacenar contraseñas, nombres de cuentas y direcciones de correo electrónico.
fr: Password Box est un service qui vous permet de stocker des mots de passe, des noms de compte et des adresses e-mail.
ja: Password Boxは、パスワード、アカウント名、メールアドレスを保存できるサービスです。
ru: Password Box — это сервис, который позволяет хранить пароли, имена учетных записей и адреса электронной почты.
zh_hans: Password Box是一项允许您存储密码、账户名称和电子邮件地址的服务。

source: I created this service because it became cumbersome to remember passwords and account names while using various web services.
ar: أنشأت هذه الخدمة لأنه أصبح من الصعب تذكر كلمات المرور وأسماء الحسابات أثناء استخدام خدمات الويب المختلفة.
es: Creé este servicio porque se volvió engorroso recordar las contraseñas y los nombres de las cuentas mientras usaba varios servicios web.
fr: J'ai créé ce service parce qu'il devenait difficile de se souvenir des mots de passe et des noms de compte en utilisant divers services web.
ja: さまざまなWebサービスを使用していると、パスワードやアカウント名を覚えるのが面倒になったため、このサービスを作成しました。
ru: Я создал этот сервис, потому что стало сложно запоминать пароли и имена учетных записей при использовании различных веб-сервисов.
zh_hans: 我创建这项服务是因为在使用各种网络服务时，记住密码和账户名称变得很麻烦。

source: This is an implementation of a vocabulary notebook on the web.
ar: هذا هو تنفيذ لمفكرة المفردات على الويب.
es: Esta es una implementación de un cuaderno de vocabulario en la web.
fr: Ceci est une implémentation d'un carnet de vocabulaire sur le web.
ja: これは、Web上での単語帳の実装です。
ru: Это реализация словарной тетради в интернете.
zh_hans: 这是一个在网络上实现的词汇笔记本。

source: Having a vocabulary notebook is convenient for remembering words and phrases when studying for national exams and the like. I created this because I thought it would be even more convenient if such a notebook could be used on the web.
ar: وجود مفكرة المفردات مريح لتذكر الكلمات والعبارات عند الدراسة للامتحانات الوطنية وما شابه. أنشأت هذا لأنني اعتقدت أنه سيكون من المريح أكثر إذا كان يمكن استخدام هذه المفكرة على الويب.
es: Tener un cuaderno de vocabulario es conveniente para recordar palabras y frases cuando se estudia para exámenes nacionales y similares. Creé esto porque pensé que sería aún más conveniente si tal cuaderno pudiera usarse en la web.
fr: Avoir un carnet de vocabulaire est pratique pour se rappeler des mots et des phrases lors de la préparation des examens nationaux et autres. J'ai créé cela car je pensais qu'il serait encore plus pratique si un tel carnet pouvait être utilisé sur le web.
ja: 単語帳があれば、国家試験などの勉強の際に単語やフレーズを覚えるのに便利です。この単語帳がWeb上で使えるとさらに便利だと思い、これを作成しました。
ru: Иметь словарную тетрадь удобно для запоминания слов и фраз при подготовке к национальным экзаменам и подобным мероприятиям. Я создал это, потому что думал, что было бы еще удобнее, если бы такая тетрадь могла использоваться в интернете.
zh_hans: 拥有一个词汇笔记本在准备国家考试等时记住单词和短语很方便。我创建这个是因为我认为如果这样的笔记本可以在网络上使用会更方便。

source: This is an app that allows you to manage database permissions in bulk using a GUI.
ar: هذا تطبيق يتيح لك إدارة أذونات قاعدة البيانات بشكل جماعي باستخدام واجهة مستخدم رسومية.
es: Esta es una aplicación que te permite gestionar permisos de bases de datos en masa utilizando una interfaz gráfica de usuario (GUI).
fr: Ceci est une application qui vous permet de gérer les autorisations de base de données en masse en utilisant une interface graphique.
ja: これは、GUIを使用してデータベースの権限を一括で管理できるアプリです。
ru: Это приложение позволяет управлять разрешениями базы данных в массовом порядке, используя графический интерфейс.
zh_hans: 这是一个允许您使用图形用户界面批量管理数据库权限的应用程序。

source: I created this app because I thought it would be convenient to manage database permissions in bulk, and it would reduce careless mistakes.
ar: أنشأت هذا التطبيق لأنني اعتقدت أنه سيكون من المريح إدارة أذونات قاعدة البيانات بشكل جماعي، وأنه سيقلل من الأخطاء العشوائية.
es: Creé esta aplicación porque pensé que sería conveniente gestionar permisos de bases de datos en masa, y reduciría errores descuidados.
fr: J'ai créé cette application car je pensais qu'il serait pratique de gérer les autorisations de base de données en masse, et cela réduirait les erreurs négligentes.
ja: データベースの権限を一括で管理できると便利であり、不注意によるミスを減らすことができると考え、このアプリを作成しました。
ru: Я создал это приложение, потому что думал, что было бы удобно управлять разрешениями базы данных в массовом порядке, и это уменьшило бы количество неосторожных ошибок.
zh_hans: 我创建这个应用程序是因为我认为批量管理数据库权限会很方便，并且会减少粗心的错误。

source: This is a household accounting app.
ar: هذا تطبيق محاسبة الأسرة.
es: Esta es una aplicación de contabilidad doméstica.
fr: Ceci est une application de comptabilité domestique.
ja: これは家庭用の会計アプリです。
ru: Это приложение для ведения домашней бухгалтерии.
zh_hans: 这是一个家庭记账应用程序。

source: I created this app as part of my graduation research at a vocational school.
ar: أنشأت هذا التطبيق كجزء من بحث التخرج في مدرسة مهنية.
es: Creé esta aplicación como parte de mi investigación de graduación en una escuela vocacional.
fr: J'ai créé cette application dans le cadre de ma recherche de fin d'études dans une école professionnelle.
ja: このアプリは、専門学校での卒業研究の一環として作成しました。
ru: Я создал это приложение в рамках своей выпускной работы в профессиональной школе.
zh_hans: 我在职业学校的毕业研究的一部分是创建这个应用程序。

source: Each member used their preferred language to create it.
ar: استخدم كل عضو اللغة المفضلة لديه لإنشائه.
es: Cada miembro usó su lenguaje preferido para crearla.
fr: Chaque membre a utilisé son langage préféré pour la créer.
ja: 各メンバーが自分の好みの言語を使用して作成しました。
ru: Каждый участник использовал свой предпочтительный язык для его создания.
zh_hans: 每个成员使用他们喜欢的语言来创建它。

source: I was responsible for the feature that automatically generates a household accounting book from receipt images.
ar: كنت مسؤولاً عن الميزة التي تنشئ تلقائيًا كتاب محاسبة الأسرة من صور الإيصالات.
es: Yo fui responsable de la función que genera automáticamente un libro de contabilidad doméstica a partir de imágenes de recibos.
fr: J'étais responsable de la fonctionnalité qui génère automatiquement un livre de comptabilité domestique à partir des images de reçus.
ja: 私は、レシートの画像から家計簿を自動生成する機能を担当しました。
ru: Я был ответственным за функцию, которая автоматически создает домашнюю бухгалтерскую книгу из изображений квитанций.
zh_hans: 我负责的功能是从收据图像自动生成家庭记账本。

source: This is an app that recognizes handwritten characters.
ar: هذا تطبيق يتعرف على الحروف المكتوبة بخط اليد.
es: Esta es una aplicación que reconoce caracteres manuscritos.
fr: Ceci est une application qui reconnaît les caractères manuscrits.
ja: これは手書き文字を認識するアプリです。
ru: Это приложение, которое распознает рукописные символы.
zh_hans: 这是一个识别手写字符的应用程序。

source: I created this app to explore computer vision in machine learning, which I was interested in at the time.
ar: أنشأت هذا التطبيق لاستكشاف رؤية الكمبيوتر في التعلم الآلي، وهو ما كنت مهتمًا به في ذلك الوقت.
es: Creé esta aplicación para explorar la visión por computadora en el aprendizaje automático, lo cual me interesaba en ese momento.
fr: J'ai créé cette application pour explorer la vision par ordinateur dans l'apprentissage automatique, qui m'intéressait à l'époque.
ja: 機械学習におけるコンピュータビジョンを探求するために、このアプリを作成しました。当時、この分野に興味がありました。
ru: Я создал это приложение, чтобы исследовать компьютерное зрение в машинном обучении, которым я интересовался в то время.
zh_hans: 我创建这个应用程序是为了探索机器学习中的计算机视觉，当时我对这个领域很感兴趣。
